In [65]:
import pandas as pd
import requests

EP = "https://raw.githubusercontent.com/ppabam/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [66]:
res = requests.get(EP)

In [12]:
# res.status_code

In [14]:
# res.encoding

In [10]:
# res.text

In [67]:
data = res.json()

In [68]:
type(data)

dict

In [70]:
endpoints = data['endpoints']
type(endpoints)

list

In [71]:
for p in endpoints:
    print(f'{p["name"]}, {p["url"]}')

TOM, https://ac.sunsin.shop/api/py/select_all
jiwon, https://agecal.wodan10.shop/api/py/select_all
heejin, https://age.journeyjean.shop/api/py/select_all
hyun, https://agecalculator.calcalhan.store/api/py/select_all
cho, https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob, https://jacob0503.vercel.app/api/py/select_table
nuni, https://ac.nunininu.shop/api/py/select_all
lucas, https://ac.lucas12.store/api/py/select_all
SEO, https://ac.seo-sigma.shop/api/py/select_all
JERRY, https://jooon.vercel.app/api/py/select_all

In [72]:
# df_tom = 
# df_jerry = 
res = requests.get("https://ac.sunsin.shop/api/py/select_all")
# res.status_code
data = res.json()
df_tom = pd.DataFrame(data)
df_tom.head(1)

  menu_name name          dt
0       설렁탕  TOM  2025-02-07

In [73]:
res = requests.get("https://jooon.vercel.app/api/py/select_all")
# res.status_code
data = res.json()
df_jerry = pd.DataFrame(data)
df_jerry.head(1)

     menu_name   name          dt
0  베이컨토마토디럭스세트  JERRY  2025-02-06

In [60]:
import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [78]:
from pandasql import sqldf
query = """
SELECT df_jerry.menu_name, df_jerry.name, df_jerry.dt
FROM df_jerry
LEFT JOIN df_tom
ON df_jerry.menu_name = df_tom.menu_name AND df_jerry.name = df_tom.name
AND df_jerry.dt = df_tom.dt
WHERE df_tom.menu_name IS NULL
"""

#pysqldf = lambda q: sqldf(q, globals())

def pysqldf(q):
    sqldf(q, locals())

df_diff_1 = sqldf(query, locals()) 
df_diff_1

        menu_name    name          dt
0     베이컨토마토디럭스세트   JERRY  2025-02-06
1             순대국     TOM  2025-01-07
2             닭개장     CHO  2025-01-07
3    닭개장(특) , 꽈배기    HYUN  2025-01-07
4             닭개장   JERRY  2025-01-07
..            ...     ...         ...
140         김치 찌개   JACOB  2025-02-03
141          샌드위치  HEEJIN  2025-02-03
142          제육볶음   LUCAS  2025-02-03
143          제육볶음    NUNI  2025-02-03
144            라면   JERRY  2025-02-09

[145 rows x 3 columns]

In [64]:
a = globals()['df1']

   id name
0   1  KIM
1   2  MIN
2   3  LEE

In [86]:
new_rows = []

for _, row_2 in df_jerry.iterrows():
    is_match_row = False
    for _, row_1 in df_tom.iterrows():
        is_match_columns = True
        for c_name in df_jerry.columns:
            if row_2[c_name] != row_1[c_name]:
                is_match_columns = False
                break
                
        if is_match_columns:
            is_match_row = True

    if not is_match_row:
        new_rows.append(row_2)
        
df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

        menu_name    name          dt
0     베이컨토마토디럭스세트   JERRY  2025-02-06
1             순대국     TOM  2025-01-07
2             닭개장     CHO  2025-01-07
3    닭개장(특) , 꽈배기    HYUN  2025-01-07
4             닭개장   JERRY  2025-01-07
..            ...     ...         ...
140         김치 찌개   JACOB  2025-02-03
141          샌드위치  HEEJIN  2025-02-03
142          제육볶음   LUCAS  2025-02-03
143          제육볶음    NUNI  2025-02-03
144            라면   JERRY  2025-02-09

[145 rows x 3 columns]

In [45]:
merge_df = pd.merge(df1, df3, how="right", indicator=True)

In [46]:
df_diff_3 = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge', axis=1)
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [49]:
## TODO
#df_diff_1, df_diff_2, df_diff_3 의 결과가 같은지 비교
df_diff_1.reset_index(drop=True).equals(df_diff_2.reset_index(drop=True))

True

In [51]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

False

In [55]:
df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [56]:
df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [59]:
df_diff_3.columns.tolist()

['id', 'name']

In [90]:
d3 = df_diff_2.sort_values(by=df_diff_2.columns.tolist()).reset_index(drop=True)
d1 = df_diff_1.sort_values(by=df_diff_1.columns.tolist()).reset_index(drop=True)
d3.equals(d1)

True

In [91]:
d3

       menu_name   name          dt
0       FORRK 카레   HYUN  2025-01-20
1            간짜장    CHO  2025-01-16
2        간짜장 곱빼기   HYUN  2025-01-16
3    고기김치찌개,라면세트   NUNI  2025-01-13
4     고등어구이,제육볶음   HYUN  2025-01-21
..           ...    ...         ...
140           한솥   NUNI  2025-01-14
141        한우 곰탕  LUCAS  2025-01-09
142       함바그 카레  JERRY  2025-01-20
143       햄 김치찌개  JACOB  2025-01-15
144       햄 김치찌개  LUCAS  2025-01-22

[145 rows x 3 columns]

In [92]:
d1

       menu_name   name          dt
0       FORRK 카레   HYUN  2025-01-20
1            간짜장    CHO  2025-01-16
2        간짜장 곱빼기   HYUN  2025-01-16
3    고기김치찌개,라면세트   NUNI  2025-01-13
4     고등어구이,제육볶음   HYUN  2025-01-21
..           ...    ...         ...
140           한솥   NUNI  2025-01-14
141        한우 곰탕  LUCAS  2025-01-09
142       함바그 카레  JERRY  2025-01-20
143       햄 김치찌개  JACOB  2025-01-15
144       햄 김치찌개  LUCAS  2025-01-22

[145 rows x 3 columns]